{
  "projects": [
    {
        "id": "libras-interpreter",
        "title": "AI Libras (Brazilian Sign Language) Alphabet Interpreter",
        "subtitle": "Hand gesture recognition powered by AI",
        "description": "This project is an AI-based system capable of interpreting the Brazilian Sign Language (Libras) alphabet using computer vision and machine learning. By leveraging MediaPipe for hand landmark detection and a Random Forest classifier trained on custom datasets, the application recognizes alphabetic signs in real-time through a webcam. The system was designed to support accessibility, offering a foundation that can later be expanded to cover words and complete sentences in Libras.",
        "category": "ai",
        "status": "completed",
        "date": "2025",
        "progress": 100,
        "image": "assets/projects/librasAI/ProjectPhoto-V.png",
        "technologies": ["Python", "OpenCV", "MediaPipe", "scikit-learn"],
        "githubLink": "https://github.com/CelebroPensante/detector-de-alfabeto-em-libras",
        "features": [
            "Real-time recognition of Libras alphabet signs via webcam",
            "Hand landmark detection with Google MediaPipe",
            "Machine learning classification with Random Forest",
            "Visualization of detected landmarks and predicted characters on screen"
        ],
        "challenges": "One of the main challenges was building a robust dataset for training the model and ensuring high accuracy across different lighting conditions, camera qualities, and hand positions. Another challenge was optimizing the real-time detection pipeline while maintaining low latency.",
        "outcomes": "The system successfully achieves accurate recognition of the Libras alphabet, providing a strong foundation for future improvements. It demonstrates how AI and computer vision can be applied to accessibility, paving the way for a more complete Libras interpreter capable of recognizing words and phrases.",
        "stats": {
          "duration": "3",
          "commits": "5",
          "tech": "5"
        },
        "gallery": [
          "assets/projects/librasAI/ProjectPhoto-V.png",
          "assets/projects/librasAI/ProjectPhoto-I.png",
          "assets/projects/librasAI/ProjectPhoto-T.png",
          "assets/projects/librasAI/ProjectPhoto-O.png",
          "assets/projects/librasAI/ProjectPhoto-R.png"
        ]
    },
    {
      "id": "SmartCook",
      "title": "SmartCook – AI Recipe Recommendation System",
      "subtitle": "Personalized recipe suggestions powered by AI",
      "description": "SmartCook is an intelligent system that recommends recipes based on user preferences, dietary restrictions, and available ingredients. It leverages natural language processing and machine learning techniques to understand user inputs (text or ingredient selection) and provide relevant recipe suggestions efficiently.",
      "category": "ai",
      "status": "in-progress",
      "date": "2025",
      "progress": 60,
      "image": "assets\\projects\\SmartCook\\HomePage.png",
      "technologies": ["Python", "Flask (or FastAPI)", "Pandas", "scikit-learn", "JavaScript/HTML/CSS"],
      "githubLink": "https://github.com/CelebroPensante/SmartCook",
      "features": [
        "Accepts input of ingredients or user preferences via API/web interface",
        "NLP processing to interpret user queries and map them to recipe data",
        "Recommendation model using similarity search or classification",
        "Backend server exposing REST endpoints for frontend or third-party integrations"
      ],
      "challenges": "One of the main challenges was defining an effective recommendation model without a fully labeled dataset, structuring recipe data, and ensuring that the API could efficiently handle user queries. Another challenge was integrating the backend with a user-friendly frontend.",
      "outcomes": "The system implements a functional backend capable of receiving inputs and returning recipe suggestions. It provides a strong foundation for future improvements, such as building a complete frontend interface, enhancing model accuracy, and adding support for advanced dietary filters.",
      "stats": {
        "duration": "2",
        "commits": "24",
        "tech": "5"
      },
      "gallery": [
        "assets\\projects\\SmartCook\\HomePage.png",
        "assets\\projects\\SmartCook\\Sugestion.png"
      ]
    }
  ]
}